<template>
    <div>
        <div class="smdialog6">
            <el-dialog
                :before-close="closefunc"
                :title="$t('btxy')"
                :visible.sync="showbytexy"
                :center="true"
            >
                <p style="color: blue; font-size: 16px">
                    {{ $t('btxy') }}
                </p>
                <p></p>
                <p>
                  {{ $t('firstParagraph') }}
<!--                    本协议是您（包括自然人、法人或其他组织，以下简称"用户"）与上海冰塔信息科技有限公司（以下简称"冰塔数科"）之间关于ByteBase隐私存储平台提供各项服务的协议。使用ByteBase隐私存储平台的任何服务即表示接受本协议的全部条款。本协议内容包括协议正文、ByteBase隐私存储平台提供的《数据上传服务协议》以及今后随时发布的关于ByteBase隐私存储平台服务的各种规范、规则等。-->
                </p>
                <p>
                  {{ $t('secondParagraph') }}
<!--                    特此声明，在使用ByteBase隐私存储平台上提供的各项服务前，请您务必事先认真阅读本协议所有内容，协议中包括了免除或者限制ByteBase隐私存储平台责任的免责条款及对用户的权利限制。请您审阅并表示接受或不接受所有服务条款，若您承诺接受则须遵守本协议约定；若您不接受则应立即停止注册程序或停止使ByteBase隐私存储平台提供的服务。若您有不明白或不理解之处，务必请向客服垂询，由客服人员向您作详细的说明和解释。-->
                </p>
                <p>
                  {{ $t('thirdParagraph') }}
<!--                    ByteBase隐私存储平台有权根据需要不时地制订、修改本协议及各种规范、规则等，并在ByteBase隐私存储平台上进行公告。变更后的协议和规范、规则一经公告，立即自动生效，您可以随时登陆ByteBase隐私存储平台查阅相关信息。如果您不同意相关变更，应当立即停止使用ByteBase隐私存储平台服务。如您继续使用ByteBase隐私存储平台服务，即视为您接受经修订的协议和规范、规则。-->
                </p>
                <p class="color">
                  {{ $t('firstTitle') }}
<!--                  一、所有权-->
                </p>
                <p>
                  {{ $t('shortParagraph1') }}
<!--                    上海冰塔信息科技有限公司保留对以下各项内容、信息完全的、不可分割的所有权及知识产权：-->
                </p>
                <p>
                  {{ $t('forthParagraph') }}
<!--                    （1）除用户自行上载、传播的内容外，ByteBase隐私存储平台及其所有元素，包括但不限于所有内容、数据、技术、软件、代码、用户界面以及与其相关的任何衍生作品；-->
                </p>
                <p>
                  {{ $t('fifthParagraph') }}
                </p>
<!--                <p>-->
<!--                    （2）用户向ByteBase隐私存储平台服务提供的与该平台服务相关的任何信息及反馈。-->
<!--                </p>-->
<!--                <p>-->
<!--                    未经上海冰塔信息科技有限公司公司同意，上述资料均不得在任何媒体直接或间接发布、播放、出于播放或发布目的而改写或再发行，或者被用于其他任何商业目的。上述资料或其任何部分仅可作为私人用途而保存在某台计算机内。-->
<!--                </p>-->
                <p>
                  {{ $t('noticeParagraph') }}
<!--                    冰塔数科服务不就由上述资料产生或在传送或递交全部或部分上述资料过程中产生的延误、不准确、错误和遗漏或从中产生或由此产生的任何损害赔偿，以任何形式向用户或任何第三方负法律、经济责任；-->
                </p>
                <p>
                  {{ $t('sixthParagraph') }}
<!--                    ByteBase隐私存储平台服务为提供网络服务而使用的任何程序（包括但不限于程序中所含的任何图像、照片、动画、录像、录音、音乐、文字和附加程序、随附的帮助材料）的一切权利均属于该软件的著作权人，未经该软件的著作权人许可，用户不得对该软件进行反向工程（reverse-->
<!--                    engineer）、反向编译（decompile）或反汇编（disassemble），或以其他方式发现其原始编码，以及实施任何涉嫌侵害著作权的行为。-->
                </p>
                <p class="color">
                  {{ $t('secondTitle') }}
<!--                  二、承诺与保证-->
                </p>
                <p>
                  {{ $t('seventhParagraph') }}
<!--                    •-->
<!--                    用户保证，其向ByteBase隐私存储平台服务上传的内容不得并禁止直接或间接的：-->
                </p>
                <p>
                  {{ $t('eighthParagraph') }}
<!--                    （1）删除、隐匿、改变ByteBase隐私存储平台服务上显示或其中包含的任何专利、版权、商标或其他所有权声明；-->
                </p>
                <p>
                  {{ $t('ninthParagraph') }}
<!--                    （2）以任何方式干扰或企图干扰ByteBase隐私存储平台服务或ByteBase隐私存储平台网站任何部分或功能的正常运行；-->
                </p>
                <p>
                  {{ $t('tenthParagraph') }}
<!--                    （3）避开、尝试避开或声称能够避开任何内容保护机制或者ByteBase隐私存储平台服务数据度量工具；-->
                </p>
                <p>
                  {{ $t('eleventhParagraph') }}
<!--                    （4）未获得冰塔数科公司事先书面同意以书面格式或图形方式使用源自冰塔数科公司的任何注册或未注册的作品、服务标志、公司徽标(LOGO)、URL或其他标志-->
                </p>
                <p>
                  {{ $t('twelfthParagraph') }}
<!--                    （5）使用任何标志，包括但不限于以对此类标志的所有者的权利的玷污、削弱和损害的方式使用冰塔数科公司标志，或者以违背本协议的方式为自己或向其他任何人设定或声明设定任何义务或授予任何权利或权限，除非冰塔数科公司以书面方式指明，否则，用户不得导出任何用户信息，并且必须在获取任何用户信息或其他冰塔数科服务内容后的-->
<!--                    24 小时内停止使用和删除它们；-->
                </p>
                <p>
                  {{ $t('thirteenthParagraph') }}
<!--                    （6）未事先经过原始用户的同意向任何非原始用户显示或以其他方式提供任何用户信息；-->
                </p>
                <p>
                  {{ $t('fourteenthParagraph') }}
<!--                    （7）请求、收集、索取、滥用或以其他方式从任何用户那里获取对冰塔数科帐号、密码或其他身份验证凭据的访问权；-->
                </p>
                <p>
                  {{ $t('fifteenthParagraph') }}
<!--                    （8）为任何用户自动登录到ByteBase隐私存储平台帐号代理身份验证凭据；-->
                </p>
                <p>
                  {{ $t('sixteenthParagraph') }}
<!--                    （9）提供跟踪功能，包括但不限于识别其他用户在个人主页上查看或操作；-->
                </p>
                <p>
                  {{ $t('seventeenthParagraph') }}
<!--                  （10）自动将浏览器窗口定向到其他网页；-->
                </p>
                <p>
                  {{ $t('eighteenthParagraph') }}
<!--                    （11）未经授权冒充他人或获取对ByteBase隐私存储平台服务的访问权；或者未经用户明确同意，让任何其他人亲自识别该用户。-->
                </p>
                <p>
                  {{ $t('ninteenthParagraph') }}
<!--                    （12）用户违反上述任何一款的保证，冰塔数科公司均有权就其情节，对其做出警告、屏蔽、直至取消资格的处罚，冰塔数科有权封禁该帐号网盘功能而无须给与任何补偿；如因用户违反上述保证而给ByteBase隐私存储平台服务、ByteBase隐私存储平台服务用户或冰塔数科公司的任何合作伙伴造成损失，用户自行负责承担一切法律责任并赔偿损失。-->
                </p>
                <p>
                  {{ $t('thirdTitle') }}
<!--                  • 用户的承诺-->
                </p>
                <p>
                  {{ $t('twentith') }}
<!--                    （1）其一经取得利用ByteBase隐私存储平台服务提供的网络服务上传、发布、传送或通过其他方式传播的内容的权利人（如有）的书面授权，并已与前述权利人就权益分配达成内部协议，保证其在将相关内容提交、上传至ByteBase隐私存储平台服务前拥有充分、完整无瑕疵、排他的所有权及知识产权。-->
                </p>
                <p>
                  {{ $t('twentyFirst') }}
<!--                    （2）用户利用ByteBase隐私存储平台服务提供的网络服务上传、发布、传送或通过其他方式传播的内容，不得含有任何违反国家法律法规政策的信息，包括但不限于下列信息：-->
                </p>
                <p>
                  {{ $t('little1') }}
<!--                  a.反对宪法所确定的基本原则的；-->
                </p>
                <p>
                  {{ $t('little2') }}
<!--                    b.危害国家安全，泄露国家秘密，颠覆国家政权，破坏国家统一的；-->
                </p>
                <p>
                   {{ $t('little3') }}
<!--                  c.损害国家荣誉和利益的；-->
                </p>
                <p>
                   {{ $t('little4') }}
<!--                  d.煽动民族仇恨、民族歧视，破坏民族团结的；-->
                </p>
                <p>
                   {{ $t('little5') }}
<!--                  e.破坏国家宗教政策，宣扬邪教和封建迷信的；-->
                </p>
                <p>
                   {{ $t('little6') }}
<!--                  f.散布谣言，扰乱社会秩序，破坏社会稳定的；-->
                </p>
                <p>
                   {{ $t('little7') }}
<!--                  g.散布淫秽、色情、赌博、暴力、凶杀、恐怖或者教唆犯罪的；-->
                </p>
                <p>
                   {{ $t('little8') }}
<!--                  h.侮辱或者诽谤他人，侵害他人合法权益的；-->
                </p>
                <p>
                   {{ $t('little9') }}
<!--                  i.含有法律、行政法规禁止的其他内容的。-->
                </p>
                <p>
                  {{ $t('twentySecond') }}
<!--                    （3）用户不得为任何非法目的而使用本网络服务系统；不得以任何形式使用ByteBase隐私存储平台存储网络服务侵犯冰塔数科公司的商业利益，包括并不限于发布非经冰塔数科公司许可的商业广告；不得利用ByteBase隐私存储平台存储网络服务系统进行任何可能对互联网或移动网正常运转造成不利影响的行为；-->
                </p>
                <p>
                  {{ $t('twentyThird') }}
<!--                  （4）用户不得利用ByteBase隐私存储平台的服务从事以下活动：-->
                </p>
                <p>
                   {{ $t('little11') }}
<!--                    a.未经允许，进入计算机信息网络或者使用计算机信息网络资源的；-->
                </p>
                <p>
                   {{ $t('little12') }}
<!--                    b.未经允许，对计算机信息网络功能进行删除、修改或者增加的；-->
                </p>
                <p>
                   {{ $t('little13') }}
<!--                    c.未经允许，对进入计算机信息网络中存储、处理或者传输的数据和应用程序进行删除、修改或者增加的；-->
                </p>
                <p>
                  {{ $t('little14') }}
<!--                  d.故意制作、传播计算机病毒等破坏性程序的；-->
                </p>
                <p>
                  {{ $t('little15') }}
<!--                  e.其他危害计算机信息网络安全的行为。-->
                </p>
                <p>
                  {{ $t('twentyForth') }}
<!--                    （5）-->
<!--                    如因用户利用ByteBase隐私存储平台提供的网络服务上传、发布、传送或通过其他方式传播的内容存在权利瑕疵或侵犯了第三方的合法权益（包括但不限于专利权、商标权、著作权及著作权邻接权、肖像权、隐私权、名誉权等）而导致冰塔数科或与冰塔数科合作的其他单位面临任何投诉、举报、质询、索赔、诉讼；或者使冰塔数科或者与冰塔数科合作的其他单位因此遭受任何名誉、声誉或者财产上的损失，用户应积极地采取一切可能采取的措施，以保证冰塔数科及与冰塔数科合作的其他单位免受上述索赔、诉讼的影响。同时用户对冰塔数科及与冰塔数科合作的其他单位因此遭受的直接及间接经济损失负有全部的损害赔偿责任。-->
                </p>
                <p class="color">
                  {{ $t('forthTitle') }}
<!--                  三、免责声明-->
                </p>
                <p>
                  {{ $t('twentyFifth') }}
<!--                    鉴于网络服务的特殊性，用户同意ByteBase隐私存储平台服务有权随时变更、中断或终止部分或全部的网络服务。如变更、中断或终止的网络服务属于免费网络服务，ByteBase隐私存储平台服务无需通知用户，也无需对任何用户或任何第三方承担任何责任。-->
                </p>
                <p>
                  {{ $t('twentySixth') }}
<!--                    用户理解，ByteBase隐私存储平台服务需要定期或不定期地对提供网络服务的平台或相关的设备进行检修或者维护，如因此类情况而造成收费网络服务在合理时间内的中断，ByteBase隐私存储平台服务无需为此承担任何责任，但ByteBase隐私存储平台服务应尽可能事先进行通告。-->
                </p>
                <p>
                  {{ $t('twentySeventh') }}
<!--                    ByteBase隐私存储平台服务可在任何时候为任何原因变更本服务或删除其部分功能。ByteBase隐私存储平台服务可在任何时候取消或终止对用户的服务。中止或终止服务后，ByteBase隐私存储平台将尽最大努力通过合理方式通知用户。当您发现无法登录或享受服务时，可以咨询我们的在线客服。一旦服务取消或终止，用户使用本服务的权利立即终止。-->
<!--                    一旦本服务取消或终止，用户在本服务中储存的任何信息可能无法恢复。-->
                </p>
                <p>
                  {{ $t('shortParagraph2') }}
<!--                  ByteBase隐私存储平台服务不保证（包括但不限于）：-->
                </p>
                <p>
                  {{ $t('little16') }}
<!--                  （1）ByteBase隐私存储平台服务适合用户的使用要求；-->
                </p>
                <p>
                  {{ $t('little17') }}
<!--                    （2）-->
<!--                    ByteBase隐私存储平台服务不受干扰，及时、安全、可靠或不出现错误；及用户经由ByteBase隐私存储平台服务取得的任何产品、服务或其他材料符合用户的期望。-->
                </p>
                <p>
                  {{ $t('little18') }}
<!--                    （3）-->
<!--                    用户使用经由ByteBase隐私存储平台服务下载或取得的任何资料，其风险由用户自行承担；因该等使用导致用户电脑系统损坏或资料流失，用户应自己负完全责任；-->
                </p>
                <p>
                  {{ $t('little19') }}
<!--                    （4）基于以下原因而造成的利润、商业信誉、资料损失或其他有形或无形损失，ByteBase隐私存储平台服务不承担任何直接、间接的赔偿：-->
                </p>
                <p>
                  {{ $t('little20') }}
<!--                  （5）对ByteBase隐私存储平台服务的使用或无法使用；-->
                </p>
                <p>
                  {{ $t('little21') }}
<!--                    （6）经由ByteBase隐私存储平台服务购买或取得的任何产品、资料或服务；-->
                </p>
                <p>
                  {{ $t('little22') }}
<!--                    （7）用户资料遭到未授权的使用或修改；及其他与ByteBase隐私存储平台服务相关的事宜。-->
                </p>
                <p>
                  {{ $t('little23') }}
<!--                    （8）由于用户授权第三方（包括第三方应用）访问/使用其ByteBase隐私存储平台服务空间的内容所导致的纠纷或损失，应由用户自行负责，与冰塔数科公司无关。-->
                </p>
                <p class="color">
                  {{ $t('fifthTitle') }}
<!--                  ByteBase隐私存储平台服务隐私政策-->
                </p>
                <p>
                  {{ $t('time1') }}
<!--                  发布时间：2021年 04 月 10 日-->
                </p>
                <p>
                  {{ $t('time2') }}
<!--                  生效时间：2021年 04 月 10 日-->
                </p>
                <p>
                  {{ $t('twentyEighth') }}
<!--                    欢迎您使用ByteBase隐私存储平台产品服务，上海冰塔信息科技有限公司（以下称“我们”或“冰塔数科”）非常重视用户隐私，本政策适用于我们提供的包括存证出证、电子合同（电子签名）等产品服务及其所包括的各种业务功能。-->
                </p>
                <p>
                  {{ $t('twentyNinth') }}
<!--                    我们希望通过本隐私政策向您说明我们在您使用我们的产品服务时如何收集、使用、保存、共享和转让、公开您的个人信息及对这些信息的保护。请您在使用我们的产品服务前仔细阅读并确认您已经充分理解本政策所写明的内容，一旦您开始使用ByteBase隐私存储平台产品服务，即表示您已充分理解并同意本政策，并同意我们按照本隐私政策收集、使用、保存和共享、转让、公开您的相关信息。如果您不同意本政策的条款，应停止使用相关服务。-->
                </p>
                <p>
                  {{ $t('noticeParagraph1') }}
<!--                  本隐私政策将帮助您了解以下内容：-->
                </p>
                <p>
                  {{ $t('little24') }}
<!--                  1、 我们如何收集和使用您的个人信息-->
                </p>
                <p>
                  {{ $t('little25') }}
<!--                  2、 我们如何存储和保护您的个人信息-->
                </p>
                <p>
                  {{ $t('little26') }}
<!--                  3、 我们如何共享、转让、公开您的个人信息-->
                </p>
                <p>
                  {{ $t('little27') }}
<!--                  4、 我们如何使用 Cookies或相关技术-->
                </p>
                <p>
                  {{ $t('little28') }}
<!--                  5、 您个人信息的管理-->
                </p>
                <p>
                  {{ $t('little29') }}
<!--                  6、 未成年人信息的保护-->
                </p>
                <p>
                  {{ $t('little30') }}
<!--                  7、 本政策的变更和修订-->
                </p>
                <p>
                  {{ $t('little31') }}
<!--                  8、 免责声明-->
                </p>
                <p>
                  {{ $t('little32') }}
<!--                  9、 联系我们-->
                </p>
                <p class="color">
                  {{ $t('sixthTitle') }}
<!--                  一、我们如何收集和使用您的个人信息-->
                </p>
                <p>
                  {{ $t('shortParagraph3') }}
<!--                    基于合法合规原则，我们仅收集使用产品服务所必要的个人信息，相关信息的收集和使用方式如下：-->
                </p>
                <p class="color">
                  {{ $t('otherTitle') }}
<!--                    （一）您在注册、使用我们服务时提供的信息-->
                </p>
                <p>
                  {{ $t('content1') }}
<!--                    1、账号注册信息：当您首次注册登录ByteBase隐私存储平台，您需要提供您的手机号码等信息，并创建登录密码。-->
                </p>
                <p>
                  {{ $t('content2') }}
<!--                    2、实名认证信息：在您使用账号存证出证或签署文档（含电子合同签署）前，您需要进行实名认证，我们会收集您的真实姓名、身份证(含证件照)、手机号码、银行卡信息、面部生物特征信息以及其他由您提供的认证信息。如您是法人单位，我们还会收集您的公司营业执照或组织机构代码证信息（含扫描件）、法定代表人实名信息（含姓名及有效证件号码等）、授权人实名信息（含姓名，有效证件号码等）、公司住所地、公司电话号码及公司对公银行账号等您提供的认证信息。-->
                </p>
                <p>
                  {{ $t('notes1') }}
<!--                  注：收集此类信息是为了满足相关法律法规的实名要求。-->
                </p>
                <p>
                  {{ $t('content3') }}
<!--                    3、数字证书信息：在基于您的实名认证信息后，我们会为您申请数字证书，并保留您的数字证书信息，此信息包含您的姓名、身份证号或企业实名信息，以及为您申请的数字证书序列号，方便您在使用签署服务时调用。-->
                </p>
                <p>
                  {{ $t('content4') }}
<!--                    4、存证信息：您在使用我们服务时我们会获取您主动上传至我方的文件或本平台其他渠道存证的文件信息，我们会对这些信息进行加密存储，并且不会分析该类信息。-->
                </p>
                <p>
                  {{ $t('content5') }}
<!--                    5、授权信息：如果您需要提供他人信息时，您需确保获得信息主体授权且保证其也愿意接受本隐私政策之约束，因为您提供的信息造成他人损害的，将由您承担责任。如果信息主体提出异议，我们将删除相关信息。-->
                </p>
                <p>
                  {{ $t('content6') }}
<!--                    6、出证服务信息：当您向我们申请出证时，您需要向我们提供您的实名信息（如您之前已在ByteBase隐私存储平台进行认证过则无需再次提供），收件信息以及其他出证所需的相关信息，包括收件人姓名、收件人手机号/座机、收件地址、实名信息、授权信息、证据信息等。-->
                </p>
                <p>
                  {{ $t('notes2') }}
<!--                    注：上述信息为您使用ByteBase隐私存储平台相关服务所必需，若您不提供这类信息，您将无法正常使用对应的产品服务。-->
                </p>
                <p class="color">
                  {{ $t('seventhTitle') }}
<!--                    （二）您在使用产品服务时我们自动收集的信息-->
                </p>
                <p>
                  {{ $t('shortParagraph4') }}
<!--                    当您使用我们的服务时，为了保障证据的有效性以及更好的优化服务，我们可能会自动收集以下相关信息并存储为服务日志信息等。-->
                </p>
                <p>
                  {{ $t('content7') }}
<!--                    1、设备信息：我们会根据您在软件安装及使用中授予的具体权限，接收并记录您所使用的设备相关信息（例如设备型号、操作系统版本、唯一设备标识符、IP地址、软件版本号等软硬件特征信息）。-->
                </p>
                <p>
                  {{ $t('content8') }}
<!--                    2、日志信息：我们会收集您对我们服务的详细使用情况，并作为有关日志保存，包括登录时间、接入网络的方式、类型状态、网络质量数据、操作日志、使用时长、服务日志、存证日志信息等。-->
                </p>
                <p>
                  {{ $t('content9') }}
<!--                    3、您通过我们的客服、网站留言或其他方式与我们联系交互时，我们可能会保存您的通信/通话记录和内容或您留下的联系方式等信息，以便我们及时与您联系反馈、解决问题等。-->
                </p>
                <p>
                  {{ $t('notes3') }}
<!--                    注：在合法合规的基础上，为了让您有更好的体验或优化我们的服务，我们可能将收集的信息用于我们的其他服务。例如，将您使用的服务信息用于用户研究分析统计，但我们不会将分析信息与您的个人身份信息相结合。-->
                </p>
                <p class="color">
                  {{ $t('eighthTitle') }}
<!--                  （三）其他用途-->
                </p>
                <p>
                  {{ $t('shortParagraph5') }}
<!--                    当我们要将您的信息用于本政策未载明的其他特定目的时，会事先征求您的同意。-->
                </p>
                <p class="color">
                  {{ $t('ninthTitle') }}
<!--                  （四）例外情况-->
                </p>
                <p>
                  {{ $t('shortParagraph6') }}
<!--                    根据相关法律法规规定，以下情形中收集您的个人信息无需征得您的授权同意：-->
                </p>
                <p>
                  {{ $t('content10') }}
<!--                  1、与国家安全、国防安全有关的。-->
                </p>
                <p>
                  {{ $t('content11') }}
<!--                  2、与公共安全、公共卫生、重大公共利益有关的。-->
                </p>
                <p>
                  {{ $t('content12') }}
<!--                  3、与犯罪侦查、起诉、审判和判决执行等有关的。-->
                </p>
                <p>
                  {{ $t('content13') }}
<!--                    4、出于维护个人信息主体或其他个人的生命、财产等重大合法权益但又很难得到本人同意的。-->
                </p>
                <p>
                  {{ $t('content14') }}
<!--                  5、所收集的个人信息是个人信息主体自行向社会公众公开的。-->
                </p>
                <p>
                  {{ $t('content15') }}
<!--                    6、从合法公开披露的信息中收集的您的个人信息的，如合法的新闻报道、政府信息公开等渠道。-->
                </p>
                <p>
                  {{ $t('content16') }}
<!--                  7、根据您的要求签订合同所必需的。-->
                </p>
                <p>
                  {{ $t('content17') }}
<!--                    8、用于维护所提供的产品与/或服务的安全稳定运行所必需的，例如发现、处置产品服务的故障。-->
                </p>
                <p>
                  {{ $t('content18') }}
<!--                  9、合法的新闻报道所需的。-->
                </p>
                <p>
                  {{ $t('content19') }}
<!--                    10、学术研究机构基于公共利益开展统计或学术研究所必要，且对外提供学术研究或描述的结果时，对结果中所包含的个人信息进行去标识化处理的.-->
                </p>
                <p>
                  {{ $t('content20') }}
<!--                  11、法律法规规定的其他情形。-->
                </p>
                <p class="color">
                  {{ $t('fifteenthTitle') }}
<!--                    二、我们如何共享、转让、公开您的个人信息-->
                </p>
                <p class="color">
                  {{ $t('sixteenthTitle') }}
<!--                  （一）共享-->
                </p>
                <p>
                  {{ $t('shortParagraph11') }}
<!--                    我们不会与任何公司、组织和个人共享您的个人信息，但以下情况除外：-->
                </p>
                <p>
                  {{ $t('content47') }}
<!--                    1、在您使用我们产品服务时，您同意在我们平台内部各个操作页面共享您的信息。-->
                </p>
                <p>
                  {{ $t('content48') }}
<!--                    2、获得您明确的同意或授权。例如，应您合法需求，协助处理您与他人的纠纷或争议。-->
                </p>
                <p>
                  {{ $t('content49') }}
<!--                  3、应您的监护人合法要求而提供您的信息。-->
                </p>
                <p>
                  {{ $t('content50') }}
<!--                    4、根据与您签署的相关协议（包括在线签署的电子合同以及相应的平台规则）或其他的法律文件约定所提供。-->
                </p>
                <p>
                  {{ $t('content51') }}
<!--                    5、根据相关的法律法规、法律程序的要求、诉讼争议解决需要，或强制性的行政或司法要求所必须的情况下进行提供。-->
                </p>
                <p>
                  {{ $t('content52') }}
<!--                    6、在法律法规允许的范围内，为维护ByteBase隐私存储平台或其他ByteBase隐私存储平台用户或社会公众利益、财产或安全免遭损害而有必要共享您的个人信息。-->
                </p>
                <p>
                  {{ $t('content53') }}
<!--                    7、为满足我们提供的产品服务目的和需要，将信息发送给支持我们业务的供应商、服务提供商，这些支持包括但不限于提供基础技术服务等专业服务。例如，我们的认证服务供应商共享您的认证信息及数据等信息。但我们仅共享业务开展必要的认证信息及相关数据等信息，-->
<!--                    认证信息如下：-->
                </p>
                <p>
                  {{ $t('little36') }}
<!--                    （1）我们会将您的真实姓名、身份证信息或企业实名信息等共享给电子认证服务的相关机构（类似CA,-->
<!--                    Certificate Authority/数字证书/电子签章）；-->
                </p>
                <p>
                  {{ $t('little37') }}
<!--                    （2）我们会将您的真实姓名、身份证信息、手机号码、银行卡信息，面部生物特征信息或企业信息共享给实名认证机构，其中包括上海银联电子支付服务有限公司等；-->
                </p>
                <p>
                  {{ $t('little38') }}
<!--                    （3）当您申请公证或司法鉴定时，我们会将您的真实姓名、身份证信息或企业实名信息等共享给相关机构；-->
                </p>
                <p>
                  {{ $t('content54') }}
<!--                    我们将在处理您的该等个人信息前，征得您的明示同意；此外，我们也将会严格遵守相关法律法规的规定，并要求我们的供应商、服务商在您的授权范围内使用您的个人信息。-->
                </p>
                <p>
                  {{ $t('content55') }}
<!--                    8、为了让您有更好的体验、改善我们的服务或经您同意的其他用途，在符合相关法律法规的前提下，我们可能将通过某些服务所收集的信息用于我们的其他服务。例如，将您在使用我们某项服务时的信息，用于另一项服务中向您展示个性化的内容或用于用户研究分析与统计等服务。-->
                </p>
                <p>
                  {{ $t('content56') }}
<!--                    为了确保服务的安全，帮助我们更好地了解我们应用程序的运行情况，我们可能记录相关信息，例如，您使用应用程序的频率、故障信息、总体使用情况、性能数据以及应用程序的来源。我们不会将我们存储在分析软件中的信息与您在应用程序中提供的个人身份信息相结合-->
                </p>
                <p>
                  {{ $t('content57') }}
<!--                    9、我们会将所收集到的信息用于大数据分析。例如，我们将收集到的信息用于分析形成不包含任何个人信息的城市热力图或行业洞察报告。我们可能对外公开并与我们的合作伙伴分享经统计加工后不含身份识别内容的信息，用于了解用户如何使用我们服务或让公众了解我们服务的总体使用趋势。-->
                </p>
                <p class="color">
                  {{ $t('seventeenthTitle') }}
<!--                  （二）转让-->
                </p>
                <p>
                  {{ $t('shortParagraph12') }}
<!--                    我们不会将您的个人信息转让给任何公司、组织和个人，但以下情况除外：-->
                </p>
                <p>
                  {{ $t('content58') }}
<!--                  1、在获取您明确同意的情况下转让。-->
                </p>
                <p>
                  {{ $t('content59') }}
<!--                    2、在ByteBase隐私存储平台所属公司发生合并、收购、资产转让、破产清算或其他类似情形时，如涉及到个人信息转让，我们会要求新的持有您个人信息的公司、组织继续受本政策的约束，否则我们将要求该公司、组织和个人重新向您征求授权同意。-->
                </p>
                <p class="color">
                  {{ $t('eighteenthTitle') }}
<!--                  （三）公开披露-->
                </p>
                <p>
                  {{ $t('shortParagraph13') }}
<!--                  我们仅会在以下情况下，公开披露您的信息：-->
                </p>
                <p>
                  {{ $t('content60') }}
<!--                  1、在您明确同意的披露方式下披露您所指定的信息。-->
                </p>
                <p>
                  {{ $t('content61') }}
<!--                    2、在法律法规、行政执法或司法要求等强制性要求下，我们可能会依据所要求的信息类型和披露方式披露您的信息。-->
                </p>
                <p>
                  {{ $t('content62') }}
<!--                  3、法律法规规定的其他情形。-->
                </p>
                <p class="color">
                  {{ $t('ninteenthTitle') }}
<!--                  （四）例外情况-->
                </p>
                <p>
                  {{ $t('shortParagraph14') }}
<!--                    以下情形中，我们共享、转让、公开披露您的个人信息无需事先征得您的授权同意：-->
                </p>
                <p>
                  {{ $t('content63') }}
<!--                  1、与国家安全、国防安全直接相关的。-->
                </p>
                <p>
                  {{ $t('content64') }}
<!--                  2、与公共安全、公共卫生、重大公共利益直接相关的。-->
                </p>
                <p>
                  {{ $t('content65') }}
<!--                  3、与犯罪侦查、起诉、审判和判决执行等直接相关的。-->
                </p>
                <p>
                  {{ $t('content66') }}
<!--                    4、-->
<!--                    出于维护您或其他个人的生命、财产等重大合法权益但又很难得到本人同意的。-->
                </p>
                <p>
                  {{ $t('content67') }}
<!--                  5、您自行向社会公众公开的个人信息。-->
                </p>
                <p>
                  {{ $t('content68') }}
<!--                    6、-->
<!--                    从合法公开披露的信息中收集个人信息的，如合法的新闻报道、政府信息公开等渠道。-->
                </p>
                <p class="color">
                  {{ $t('twentithTitle') }}
<!--                  三、我们如何存储和保护您的个人信息-->
                </p>
                <p class="color">
                  {{ $t('twentyOneTitle') }}
<!--                  （一）信息存储-->
                </p>
                <p>
                  {{ $t('shortParagraph15') }}
<!--                    我们在中华人民共和国境内收集和产生的个人信息将存储在中华人民共和国境内。-->
                </p>
                <p>
                  {{ $t('content69') }}
<!--                    1、我们仅在本政策所属要求、所必须期间和法律法规要求的时限内存储您的个人信息。-->
                </p>
                <p>
                  {{ $t('content70') }}
<!--                    2、如我们停止运营ByteBase隐私存储平台的产品服务，我们将及时停止继续收集您个人信息的活动，并且将停止运营的通知以公告或其他的方式通知您，除在达成本政策目的所需的期限内保留您的信息外，对我们存储的信息进行删除或匿名化处理。-->
                </p>
                <p class="color">
                  {{ $t('otherTitle1') }}
<!--                  （二）信息保护-->
                </p>
                <p>
                  {{ $t('othetTitle2') }}
<!--                  我们将采取以下手段保护您的信息：-->
                </p>
                <p>
                  {{ $t('otherContent1') }}
<!--                    1、安全防护措施：我们已使用符合业界标准的安全防护措施，安全技术解决方案来保护您的个人信息，防止您的信息遭到未经授权的访问、使用、篡改,避免数据的损坏丢失或泄露。-->
                </p>
                <p>
                  {{ $t('otherContent2') }}
<!--                    2、权限控制：我们建立系统信息安全及监督机制，有效防控人员访问您的信息，并为此设置了严格的访问权限控制。-->
                </p>
                <p>
                  {{ $t('otherContent3') }}
<!--                    3、应急预案：如果不幸发生我们的物理、技术或管理防护措施遭到破坏的事件，我们会及时启动应急预案，防止安全事件扩大，按照法律法规的要求上报国家主管机关，并及时采取推送公告等合理有效的方式向您告知安全事件的基本情况、可能的影响、已经采取的措施或将要采取的措施等。-->
                </p>
                <p class="color">
                  {{ $t('twentyTwoTitle') }}
<!--                  四、我们如何使用 Cookies或相关技术-->
                </p>
                <p>
                  {{ $t('little52') }}
<!--                    在您使用我们的产品服务时，我们平台可能会通过采用各种技术收集和记录您访问ByteBase隐私存储平台服务的相关数据，其中包括您的-->
<!--                    IP-->
<!--                    地址，您生成的电子签章，软硬件特征信息、以及您需求的网页记录，Cookies-->
<!--                    中的信息等。在您访问或再次访问ByteBase隐私存储平台服务时,我们能识别您的身份，并通过分析数据为您提供更好更多的服务。我们不会将-->
<!--                    Cookies-->
<!--                    用于本隐私政策所述目的之外的任何用途，您有权选择接受或拒绝接受Cookies。您可以通过修改浏览器的设置以拒绝接受Cookies，但是我们需要提醒您，因为您拒绝接受Cookies，您可能无法使用依赖于Cookies的部分功能，例如您每一次访问服务，之前所记录的相应信息均会被删除。-->
                </p>
                <p class="color">
                  {{ $t('twentyThreeTitle') }}
<!--                  五、您个人信息的管理-->
                </p>
                <p>
                  {{ $t('shortParagraph16') }}
<!--                    您具有管理个人信息的权利，包括对于您个人信息的访问、更正、删除等操作。-->
                </p>
                <p class="color">
                  {{ $t('twentyFourTitle') }}
<!--                  （一） 访问-->
                </p>
                <p>
                  {{ $t('shortParagraph17') }}
<!--                    您可以通过访问ByteBase隐私存储平台官网https://www.bytebase.cn/来查阅、编辑您账户中的个人信息、更改您的密码、添加安全信息。-->
                </p>
                <p class="color">
                  {{ $t('twentyFiveTitle') }}
<!--                  （二）更正-->
                </p>
                <p>
                  {{ $t('shortParagraph18') }}
<!--                    当您发现收集、存储的个人信息有误，您可以根据自身实际情况进行更正、更新或删除。-->
                </p>
                <p class="color">
                  {{ $t('twentySixTitle') }}
<!--                  （三） 删除-->
                </p>
                <p>
                  {{ $t('content71') }}
<!--                    1、以下情况发生时，您有权要求“ByteBase隐私存储平台”删除您的个人信息：-->
                </p>
                <p>
                  {{ $t('little39') }}
<!--                  （1）我们处理您的个人信息违反了法律法规要求。-->
                </p>
                <p>
                  {{ $t('little40') }}
<!--                  （2）我们违反了与您的约定来收集、使用和处理您的个人信息。-->
                </p>
                <p>
                  {{ $t('little41') }}
<!--                    （3）您注销了“ByteBase隐私存储平台”帐号、卸载或者不再使用我们的产品（或服务）。-->
                </p>
                <p>
                  {{ $t('little42') }}
<!--                  （4）我们停止对您提供服务。-->
                </p>
                <p>
                  {{ $t('content72') }}
<!--                  2、删除的例外-->
                </p>
                <p>
                  {{ $t('shortParagraph19') }}
<!--                    基于业务的需要，为维护交易多方的利益，在前述删除条款第（3）和（4）点的情形下，我们仍将保留您与业务直接关联的个人信息直至该业务保存期限到期。如您仍想删除此部分信息，需您与业务全部相关方授权同意，我们在收到您与业务全部相关方共同的删除指令后，会将该业务涉及的您的个人信息进行删除。-->
                </p>
                <p class="color">
                  {{ $t('twentySevenTitle') }}
<!--                  （四）注销-->
                </p>
                <p>
                  {{ $t('shortParagraph20') }}
<!--                    如您需要注销您的账号，即不再使用我们的产品服务时，您可以联系客服申请注销您的账户。-->
                </p>
                <p class="color">
                  {{ $t('twentyEightTitle') }}
<!--                  （五）响应您的上诉请求-->
                </p>
                <p>
                  {{ $t('shortParagraph21') }}
<!--                    为保障安全，您可能需要提供书面请求，或以其他方式证明您的身份。我们可能会先要求您验证自己的身份，然后再处理您的请求。-->
                </p>
                <p>
                  {{ $t('shortParagraph22') }}
<!--                    我们将在十五天内做出答复。如您不满意，还可以通过再次联系客服进行投诉。-->
                </p>
                <p>
                  {{ $t('shortParagraph23') }}
<!--                    对于您合理的请求，我们原则上不收取费用，但对多次重复、超出合理限度的请求，我们将视情收取一定成本费用。对于那些无端重复、需要过多技术手段（例如，需要开发新系统或从根本上改变现行惯例）、给他人合法权益带来风险或者非常不切实际（例如，涉及备份磁带上存放的信息）的请求，我们可能会予以拒绝。-->
                </p>
                <p>
                  {{ $t('shortParagraph24') }}
<!--                  在以下情形中，按照法律法规要求，我们将无法响应您的请求：-->
                </p>
                <p>
                  {{ $t('content73') }}
<!--                  1、与国家安全、国防安全直接相关的；-->
                </p>
                <p>
                  {{ $t('content74') }}
<!--                  2、与公共安全、公共卫生、重大公共利益直接相关的；-->
                </p>
                <p>
                  {{ $t('content75') }}
<!--                  3、与犯罪侦查、起诉、审判和判决执行等直接相关的；-->
                </p>
                <p>
                  {{ $t('content76') }}
<!--                  4、有充分证据表明您存在主观恶意或滥用权利的；-->
                </p>
                <p>
                  {{ $t('content77') }}
<!--                    5、响应您的请求将导致您或其他个人、组织的合法权益受到严重损害的。-->
                </p>
                <p>
                  {{ $t('content78') }}
<!--                  6、涉及商业秘密的。-->
                </p>

                <p class="color">
                  {{ $t('twentyNineTitle') }}
<!--                  六、未成年人信息的保护-->
                </p>
                <p>
                  {{ $t('shortParagraph25') }}
<!--                    我们的产品服务对象主要为成年人，如您未满18周岁，如果没有父母或监护人的同意，不得创建自己的用户账户。请您的父母或法定监护人仔细阅读本隐私政策，并在征得您的父母或监护人同意的前提下使用我们的服务或向我们提供信息。-->
                </p>
                <p>
                  {{ $t('shortParagraph26') }}
<!--                    对于经父母或监护人同意使用我们的产品服务而收集未成年人个人信息的情况，我们只会在法律法规允许，父母或监护人明确同意或者保护未成年人所必要的情况下使用，共享，转让或披露此信息。我们将根据国家相关法律法规及本隐私政策的规定保护未成年人的个人信息。-->
                </p>
                <p class="color">
                  {{ $t('thirtyTitle') }}
<!--                  七、本政策的变更和修订-->
                </p>
                <p>
                  {{ $t('shortParagraph27') }}
<!--                    为了给您提供更好的服务，我们会适时变更、修订本政策内容。我们会通过在ByteBase隐私存储平台网站、移动端上推送系统通知或其他方式提醒您本政策的更新，也请您及时访问ByteBase隐私存储平台官网或客户端以便了解最新的隐私政策。-->
                </p>
                <p>
                  {{ $t('shortParagraph28') }}
<!--                    注：本隐私政策如有更新，我们会及时提示您，如您继续使用我们的产品服务，即意味着您依然同意更新后的隐私政策内容，并且同意我们继续按照本隐私政策收集、使用、保存和共享您的相关信息。-->
<!--                    如果您不同意更新后的隐私政策内容，应停止使用相关服务。-->
                </p>
                <p class="color">
                  {{ $t('thirtyOneTitle') }}
<!--                  八、免责声明-->
                </p>
                <p>
                  {{ $t('shortParagraph29') }}
<!--                    互联网环境并非绝对安全的环节，请使用复杂密码，并妥善保管。因您个人原因导致账号密码泄露从而导致个人信息泄露或盗用的，存证云不负任何责任，但我们会积极地配合您更改密码等方式减少不良影响。-->
                </p>
                <p class="color">
                  {{ $t('thirtyTwoTitle') }}
<!--                  九、联系我们-->
                </p>
                <p>
                  {{ $t('shortParagraph30') }}
<!--                  如果您：-->
                </p>
                <p>
                  {{ $t('content79') }}
<!--                  1、对我们的隐私政策有问题、意见或者建议-->
                </p>
                <p>
                  {{ $t('content80') }}
<!--                  2、对于您的个人信息的处理有问题、意见或者投诉举报-->
                </p>
                <p>
                  {{ $t('content81') }}
<!--                  3、需要对您个人信息进行更改，删除或账号注销-->
                </p>
                <p>
                  {{ $t('content82') }}
<!--                  4、需要撤回平台对您个人信息的收集或改变您授权同意的范围-->
                </p>
                <p>
                  {{ $t('shortParagraph31') }}
<!--                    注：每个业务功能需要一些基本的个人信息才能得以完成。除此之外，对于额外个人信息的收集和使用，您可以联系客服联系给予或收回您的授权同意。当您收回同意后，我们将不再处理相应的个人信息。但您收回同意的决定，不会影响此前基于您的授权而开展的个人信息处理。-->
                </p>
                <p>
                  {{ $t('shortParagraph32') }}
<!--                    请联系客服与我们联系，我们将及时对您的问题进行受理并处理。-->
                </p>
            </el-dialog>
        </div>
    </div>
</template>

<script>
export default {
  props: ['showbytexy'],
  data () {
    return {
      show: this.showbytexy
    }
  },

  mounted () {
    console.log(this.showbytexy, '993')
  },
  methods: {
    closefunc (done) {
      this.$emit('closexy')
    }
  }
}
</script>

<style scoped>
.smdialog6 >>> .el-dialog__body {
    height: 800px;
    padding: 32px !important;
    word-wrap:break-word;
    word-break:normal;
    display: block;
    padding-bottom: 50px !important;
}.smdialog6 >>> .el-dialog__title {
    font-size: 19px;
 }
.color {
  color: blue;
}
</style>
